Revit 2027 API
ParameterTypeId.BoundaryDirectionY Property
 "Y Translation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryDirectionY { get; }
Public Shared ReadOnly Property BoundaryDirectionY As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryDirectionY {
	ForgeTypeId^ get ();
}
static member BoundaryDirectionY : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace